<a href="https://colab.research.google.com/github/mohankumaranem/basics-of-data-science/blob/master/Assingnment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1) Write a function in python that inputs a dataframe and identify which columns have date in them. Using these date columns make new columns which are difference between these columns taking 2 at a time. (for instance if there is date1, date2, date3 columns, output should be like date1-date2, date2-date3, date1-date3). For this problem only, print out data in the colab.

Thing to consider

· Date column might have some invalid entries in them

· Date can be of different format throughout the column

· Code should be efficient and fast

· Code should be well commented and easy to interpret

· Used google Colab

· Code should be robust enough to run on any dataset

· here dataset made by me was made in excel hence it the result will be constant output because i used excel short cuts to create dataset.

In [219]:
import numpy as np
import pandas as pd
import datetime  as dt
"""importing all necessary libraries for the code"""

'importing all necessary libraries for the code'

### **I Am Using my Own Dataset In Excel Format**

In [222]:
df=pd.read_excel('Book2.xlsx')
print(df.dtypes)
df.head()

Date 1               object
Category             object
DayOfWeek            object
Date 2       datetime64[ns]
Address              object
Date 3       datetime64[ns]
Location             object
Date 4       datetime64[ns]
dtype: object

                Date 1  ...     Date 4
0            3/33/2015  ... 2017-06-05
1  2015-02-02 00:00:00  ... 2017-06-06
2  2015-02-03 00:00:00  ... 2017-06-07
3           42/14/2015  ... 2017-06-08
4  2015-02-05 00:00:00  ... 2017-06-09

[5 rows x 8 columns]

### **As you can see the Date 1  contains some invalid dates hence it did not recognised as datetime instead of it recognised as object**

In [216]:
j=df.columns.to_list()
for i  in j:
  df1[i]=pd.to_datetime(df[i],errors='coerce')
df1 = df1.dropna(how='all', axis=1)
df1.head()

      Date 1     Date 2     Date 3     Date 4
0        NaT 1999-01-07 1999-04-04 2017-06-05
1 2015-02-02 1999-01-08 1999-04-05 2017-06-06
2 2015-02-03 1999-01-09 1999-04-06 2017-06-07
3        NaT 1999-01-10 1999-04-07 2017-06-08
4 2015-02-05 1999-01-11 1999-04-08 2017-06-09

### **and you can see the data is processed and cleaned by replacing invalid dates into NaT**

In [221]:
k=np.asanyarray(df1.select_dtypes(include=['datetime64']).columns)
for i in  range(0,len(k)):
  if i==len(k)-1:
    df1['date'+str(i+1)+'-date'+str(len(k)-i)]=(df1[k[0]]-df1[k[-1]]).dt.days
  else:    
    df1['date'+str(i+1)+'-date'+str(i+2)]=(df1[k[i]]-df1[k[i+1]]).dt.days
df1.head()

      Date 1     Date 2     Date 3  ... date2-date3  date3-date4  date4-date1
0        NaT 1999-01-07 1999-04-04  ...         -87        -6637          NaN
1 2015-02-02 1999-01-08 1999-04-05  ...         -87        -6637       -855.0
2 2015-02-03 1999-01-09 1999-04-06  ...         -87        -6637       -855.0
3        NaT 1999-01-10 1999-04-07  ...         -87        -6637          NaN
4 2015-02-05 1999-01-11 1999-04-08  ...         -87        -6637       -855.0

[5 rows x 8 columns]

and From above DataFrame you can see that the invalid dates are handled correctly and calculated the difference correctly 
# **NOTE:Here dataset made by me was made in excel hence it the result will be constant output because i used excel short cuts to create dataset and negative values indicates we subracting 1999-2017 hence we get days by negative**